import React from 'react';
import CardItem from '../Assets/UI/CardItem/CardItem';
import module from '../Assets/UI/styles/cards.module.css';

const Cards = () => {
    return (
        <div className={module.container}>
            <div className={module.title}> Клубные карты СпортСити Северный</div>
            <div className={module.subTitle}> Выбирайте карту на любой срок</div>
            <div className={module.gridContainer}>
                <CardItem
                    title={"Фитнес + бассейн 3 месяца"}
                    tariff={"Дневная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—17:00</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 3 месяца"}
                    tariff={"Студенческая безлимитная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 3 месяца"}
                    tariff={"Безлимитная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 6 месяцев"}
                    tariff={"Дневная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—17:00</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 6 месяцев"}
                    tariff={"Безлимитная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 9 месяцев"}
                    tariff={"Дневная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—17:00</li>
                        <li>90 дней заморозки</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка в подарока</li>
                        <li>Массаж 20 минут в подарок</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 9 месяцев"}
                    tariff={"Безлимитная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>90 дней заморозки</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка в подарока</li>
                        <li>Массаж 20 минут в подарок</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 12 месяцев"}
                    tariff={"Дневная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—17:00</li>
                        <li>90 дней заморозки</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 12 месяцев"}
                    tariff={"Безлимитная карта"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>90 дней заморозки</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
                <CardItem
                    title={"Фитнес + бассейн 12 месяцев"}
                    tariff={"Рассрочка от Сбербанка"}
                >
                    <ul>
                        <li>Время посещения: 7:00—23:00</li>
                        <li>90 дней заморозки</li>
                        <li>Безлимитное посещение тренажерного зала</li>
                        <li>Безлимитное посещение бассейна</li>
                        <li>Более 100 групповых программ</li>
                        <li>Онлайн-тренировки</li>
                        <li>Персональная тренировка</li>
                        <li>Массаж</li>
                        <li>Солярий</li>
                        <li>Гостевые визиты</li>
                    </ul>
                </CardItem>
            </div>
        </div>
    );
};

export default Cards;